docs/gha/workflows.md
```mermaid
sequenceDiagram
    actor Developer
    participant GH as GitHub UI 
    participant Workflow as Controlling Workflow 
    participant TestWorkflow as Reusable Test Workflow 
    participant BuildWorkflow as Reusable Build Workflow
    participant CodeCov
    
    alt Create PR
        Developer ->> GH: Create PR against develop
        GH ->> GH: emits event (pull_request opened)
    else Reopen PR
        Developer ->> GH: Reopen closed PR
        GH ->> GH: emits event (pull_request reopened)
    else Update PR source branch
        Developer ->> GH: Push commits to source branch for PR
        GH ->> GH: emits event (pull_request synchronize)
    end
    
    activate Workflow
    GH ->> Workflow: Runs (if event matches)
    
    Workflow ->> TestWorkflow: Runs
    
    rect rgb(38, 103, 138)
    note over Developer,CodeCov: Testing

    activate TestWorkflow
    TestWorkflow ->> Workflow : if any test fails (exit with error)
    Workflow ->> GH: if exit with error (terminate workflow)
    GH ->> Developer: show error
    TestWorkflow ->> CodeCov: sends coverage
    TestWorkflow ->> Workflow: success
    deactivate TestWorkflow
    
    end
    
    Workflow ->> BuildWorkflow: Runs
    
    rect rgb(15, 98, 72)
    note over Developer,CodeCov: Build Image
    
    activate BuildWorkflow
    BuildWorkflow ->> BuildWorkflow: build image
    BuildWorkflow ->> Workflow: if build fails (exit with error)
    Workflow ->> GH: if exit with error (terminate workflow)
    GH ->> Developer: show error
    BuildWorkflow ->> Workflow:success
    deactivate BuildWorkflow
    
    Workflow ->> GH:success
    
    end
    
    deactivate Workflow
    GH ->> Developer: show success
```
