docs/gha/diagrams/pull-request-develop-merged-sequence.puml
@startuml

Developer -> "GitHub UI": Merge PR to ""develop""
"GitHub System" -> "GitHub System": emits event\n ""pull_request"" ""closed""
"GitHub System" -> "Controlling Workflow": Runs\n if matches event and merged
"Controlling Workflow" -> "Reusable Test Workflow": Runs
"Reusable Test Workflow" -[#red]> "Controlling Workflow" : if any test fails\nexit with error
"Controlling Workflow" -[#red]> "GitHub UI": if exit with error\nterminate workflow
"GitHub UI" -[#red]> "GitHub UI": show error
"Reusable Test Workflow" -> "CodeCov": sends coverage
"Controlling Workflow" -> "Reusable Build/Push Workflow": Runs\ninput: name, tag
"Reusable Build/Push Workflow" -> "Reusable Build/Push Workflow": build image
"Reusable Build Workflow" -[#red]> "Controlling Workflow": if build fails\nexit with error
"Controlling Workflow" -[#red]> "GitHub UI": if exit with error\nterminate workflow
"GitHub UI" -[#red]> "GitHub UI": show error
"Reusable Build/Push Workflow" -> "GitHub Container Registry": push image\n ""sample_service-develop/latest""
"Reusable Build Workflow" -[#green]> "Controlling Workflow":success
"Controlling Workflow" -[#green]> "GitHub UI":success
"GitHub UI" -[#green]> "GitHub UI": show success

@enduml
