docs/gha/workflows.md
```mermaid
sequenceDiagram
    actor Developer
    participant GH as GitHub UI 
    participant Workflow as Controlling Workflow 
    participant TestWorkflow as Reusable Test Workflow 
    participant BuildWorkflow as Reusable Build/Push Workflow
    participant GHCR as GitHub Container Registry
    participant CodeCov
    
    Developer ->> GH: Merge PR into develop 
    GH ->> GH: emits event (pull_request closed)
    
    GH ->> Workflow: Runs (if event matches and merged)
    
    activate Workflow
    
    Workflow ->> TestWorkflow: Runs
    activate TestWorkflow
    
    rect rgb(38, 103, 138)
    note over Developer,CodeCov: Testing
    
    TestWorkflow ->> Workflow : if any test fails (exit with error)
    Workflow ->> GH: if exit with error (terminate workflow)
    GH ->> Developer: show error
    TestWorkflow ->> CodeCov: sends coverage
    TestWorkflow ->> Workflow: success
    deactivate TestWorkflow
    
    end
    
    Workflow ->> BuildWorkflow: Runs
    
    rect rgb(15, 98, 72)
    note over Developer,CodeCov: Build and Push Image
    
    activate BuildWorkflow
    BuildWorkflow ->> BuildWorkflow: build image
    BuildWorkflow ->> Workflow: if build fails (exit with error)
    Workflow ->> GH: if exit with error (terminate workflow)
    GH ->> Developer: show error
    BuildWorkflow ->> Workflow:success
    
    BuildWorkflow ->> GHCR: Login (GHCR_USERNAME, GHCR_TOKEN)
    BuildWorkflow ->> Workflow: if login fails (exit with error)
    Workflow ->> GH: if exit with error (terminate workflow)
    GH ->> Developer: show error
    
    BuildWorkflow ->> GHCR: push image (sample_service-develop:latest)
    BuildWorkflow ->> Workflow:success
    
    deactivate BuildWorkflow
    
    Workflow ->> GH:success
    
    end
    
    deactivate Workflow
    GH ->> Developer: show success
```
